---
kind: method
id: M:Autodesk.Revit.DB.SpatialElementBoundarySubface.GetSpatialElementFace
source: html/8e596dfa-d9d8-b497-7b2b-e9e1eefe378e.htm
---
# Autodesk.Revit.DB.SpatialElementBoundarySubface.GetSpatialElementFace Method

Returns the face of the spatial element's 3D geometry.

## Syntax (C#)
```csharp
public Face GetSpatialElementFace()
```

## Returns
The face of the spatial element's 3D geometry.